Repository: IfcOpenShell/IfcOpenShell
Catalog: src/ifcbimtester/bimtester/locale/*/LC_MESSAGES/messages.po
Languages: it, nl

source: en
it: it
nl: nl

source: Success
it: Successo
nl: Succes

source: Failure
it: Errore
nl: Fout

source: Tests passed
it: Test superati
nl: Tests geslaagd

source: Duration
it: Durata
nl: Tijdsduur

source: OpenBIM auditing is a feature of
it: L'auditing OpenBIM è una caratteristica di
nl: OpenBIM-auditing is een kenmerk van

source: and
it: e
nl: en

source: All {elemcount} elements in the file are {ifc_class}.
it: Tutti {elemcount} elementi nel file sono classificati {ifc_class}
nl: Alle {elemcount} de elementen in het bestand zijn {ifc_class}

source: {falsecount} of {elemcount} element are {ifc_class} elements: {falseelems}
it: {falsecount} di {elemcount} elementi sono elementi {ifc_class}: {falseelems}
nl: {falsecount} van de {elemcount} elementen zijn {ifc_class} elementen: {falseelems}

source: Error in falsecount, something went wrong.
it: Errore in falsecount, qualcosa è andato storto.
nl: Fout in de telling, er is iets misgegaan.

source: For all {elemcount} {ifc_class} elements at least one of these class attributes {parameter} has no value.
it: Per tutti {elemcount} elementi {ifc_class} almeno uno di questa classedegli attributi {parameter} non contiene alcun valore
nl: Voor alle {elemcount} {ifc_class} elementen heeft ten minste één van deze class attributen {parameter} heeft geen waarde.

source: For the following {falsecount} out of {elemcount} {ifc_class} elements at least one of these class attributes {parameter} has no value: {falseelems}
it: Per i seguenti {falsecount} di {elemcount} elementi {ifc_class}almeno uno degli attributi {parameter} non contiene alcun valore
nl: Van de {falsecount} uit {elemcount} {ifc_class} elementen op ten minste een van deze class-attributen {parameter} heeft geen waarde:{falseelems}

source: There are no {ifc_class} elements in the IFC file.
it: Il file IFC non contiene elementi della classe {ifc_class}.
nl: Er zijn geen {ifc_class} elementen in het IFC-bestand.

source: The name of all {elemcount} {elemcount} elements is not set.
it: Il nome di {elemcount} {elemcount} elementi non è impostato
nl: De naam van alle {elemcount} {elemcount} elementen is niet ingesteld.

source: The name of {falsecount} out of {elemcount} {ifc_class} elements is not set: {falseelems}
it: Il nome di {falsecount} su {elemcount} elementi {ifc_class} non èimpostato
nl: De naam van {falsecount} van de {elemcount} {ifc_class} elementen is nietset: {falseelems}

source: The description of all {elemcount} {elemcount} elements is not set.
it: La descrizione di tutti {elemcount} {elemcount} elementi non èimpostato
nl: De beschrijving van alle {elemcount} {elemcount} elementen is niet ingesteld.

source: The description of {falsecount} out of {elemcount} {ifc_class} elements is not set: {falseelems}
it: la descrizione di {falsecount} su {elemcount} elementi {ifc_class} non èimpostato
nl: De beschrijving van {falsecount} uit {elemcount} {ifc_class} elementen is niet ingesteld: {falseelems}

source: All {elemcount} {ifc_class} elements are missing the property {parameter} in the pset.
it: A {elemcount} gli elementi {ifc_class} manca la proprietà {parameter}nello pset.
nl: Alle {elemcount} {ifc_class} elementen missen de eigenschap {parameter} in de pset.

source: The following {falsecount} of {elemcount} {ifc_class} elements are missing the property {parameter} in the pset: {falseelems}
it: Ai seguenti {falsecount} di {elemcount} elementi {ifc_class} manca la proprietà{parameter} nello pset: {falseelems}
nl: De volgende {falsecount} van {elemcount} {ifc_class} elementen zijn ontbreekt de eigenschap {parameter} in de pset: {falseelems}

source: All {elemcount} {ifc_class} elements are not a {parameter} representation.
it: Tutti {elemcount} elementi {ifc_class} non rappresentano {parameter}
nl: Alle {elemcount} {ifc_class} elementen zijn geen {parameter} representatie.

source: The following {falsecount} of {elemcount} {ifc_class} elements are not a {parameter} representation: {falseelems}
it: I seguenti {falsecount} di {elemcount} elementi {ifc_class} non rappresentano{parameter}: {falseelems}
nl: De volgende {falsecount} van {elemcount} {ifc_class} -elementen zijn geen {parameter} representatie: {falseelems}

source: The geometry of all {elemcount} {ifc_class} elements have errors.
it: La geometria di tutti {elemcount} elementi {ifc_class} contiene errori
nl: De geometrie van alle {elemcount} de {ifc_class} elementen bevatten fouten.

source: The geometry of {falsecount} out of all {elemcount} {ifc_class} elements have errors: {falseelems}
it: La geometria di {falsecount} su {elemcount} elementi {ifc_class} contieneerrori: {falseelems}
nl: De geometrie van {falsecount} van alle {elemcount} {ifc_class} elementen hebben fouten: {falseelems}

source: We expected a schema of {} but instead got {}
it: Ci aspettavamo uno schema di {} ma invece abbiamo ottenuto {}
nl: We verwachtten een schema van {} maar kregen in plaats daarvan {}
